package com.javarush.task.task27.task2712;

public class z_Tt_Description {
    // Tablet - это номер планшета, чтобы можно было однозначно установить, откуда поступил заказ.
    // Order (заказ) должна быть информация, относящаяся к списку выбранных пользователем блюд.
    //  Dish(Блюдо), создадим его в пакете kitchen. Пусть это будет enum со списком блюд: Fish, Steak, Soup, Juice, Water.

    // вот и зачем создавать public boolean isEmpty(), если уже есть метод getTotalCookingTime
    // Затем, что это логически разные методы. С точки зрения ООП, каждый метод решает свою задачу,
    // а не является 3 в 1, средством для решения всех проблем.
}
