package com.javarush.task.task27.task2712;
// опять эта комбинаторика с теорией графов..
public class zzz_ttttMp {
// Этот набор должен удовлетворять следующим требованиям:
//1) сумма денег, полученная от показов, должна быть максимальной из всех возможных вариантов
//2) общее время показа рекламных роликов НЕ должно превышать время приготовления блюд для текущего заказа;
//3) для одного заказа любой видео-ролик показывается не более одного раза;

//4) если существует несколько вариантов набора видео-роликов с одинаковой суммой денег, полученной от показов, то:
//  4.1) выбрать тот вариант, у которого суммарное время максимальное;
//  4.2) если суммарное время у этих вариантов одинаковое, то выбрать вариант с минимальным количеством роликов;
//  5) количество показов у любого рекламного ролика из набора - положительное число.

// 6.	В набор должны отбираться только ролики с положительным числом показов.
// 7.	Для каждого показанного ролика должен быть вызван метод revalidate.
//              - он уменьшает счетчик доступных показов, для текущего ролика

    // SORT
// 2.4. Отобразить все рекламные ролики, отобранные для показа, в порядке уменьшения стоимости показа
// одного рекламного ролика в копейках.
// Вторичная сортировка - по увеличению стоимости показа одной секунды рекламного ролика в тысячных частях копейки
// Используйте метод Collections.sort

    // P.S. Не забудь что время приготовления заказа считается в минутах, а время показа рекламы в секундах!
}
