package com.javarush.task.task26.task2613;

public class Tmp {
    // CashMachine (3)
    //1. Создай класс CurrencyManipulator, который будет хранить всю информацию про выбранную валюту.
    // 2. Валют может быть несколько, поэтому нам понадобится фабрика, которая будет создавать и хранить манипуляторы.
    //Создай класс CurrencyManipulatorFactory

    // CashMachine (4)
    //1. Выберем операцию, с которой мы сможем начать.
    //Подумаем. В банкомате еще денег нет, поэтому INFO и WITHDRAW протестить не получится.
    //Начнем с операции DEPOSIT - поместить деньги.
    //Считаем с консоли код валюты, потом считаем номинал и количество банкнот, а потом добавим их в манипулятор.
    //
    //2. Чтобы считать код валюты, добавим статический метод String askCurrencyCode() в ConsoleHelper.
    // 3. Чтобы считать номинал и количество банкнот, добавим статический
    // метод String[] getValidTwoDigits(String currencyCode) в ConsoleHelper.
    // Этот метод должен предлагать пользователю ввести два целых положительных числа.
    //Первое число - номинал, второе - количество банкнот. _ например 100 рублей 5 бумаг т.е. 100 5








}